tests/waveTank/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (0 -50 -1)
    (0 -4 -1)
    (0 4 -1)
    (0 15 -1)
    
    (500 -50 -1)
    (500 -4 -1)
    (500 4 -1)
    (500 15 -1)

    (500 -50 1)
    (500 -4 1)
    (500 4 1)
    (500 15 1)

    (0 -50 1)
    (0 -4 1)
    (0. 4 1)
    (0 15 1)
);


blocks
(
    hex (0 4 5 1 12 8 9 13) (500 50 1) simpleGrading (1 .4 1)
    hex (1 5 6 2 13 9 10 14) (500 16 1) simpleGrading (1 1 1)
    hex (2 6 7 3 14 10 11 15) (500 15 1) simpleGrading (1 2 1)
);

edges
(
);

patches
(
    patch left
    (
       	(0 1 13 12)
       	(1 2 14 13)
       	(2 3 15 14)
    )
    patch right
    (
       	(8 9 5 4)
       	(9 10 6 5)
       	(10 11 7 6)
    )
    patch bottom
    (
       	(0 12 8 4)
    )
    patch top
    (
       	(3 7 11 15)
    )
    empty frontAndBack
    (
        (4 5 1 0)
       	(5 6 2 1)
       	(6 7 3 2)
	(9 8 12 13)
	(10 9 13 14)
	(11 10 14 15)
    )	
);

mergePatchPairs
();


// ************************************************************************* //
